balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/16xxxx/PIC16F1847.PIC
        <edc:SFRDef edc:access="nnn-nnnn" edc:cname="MDCARL" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuu-uuuu" edc:name="MDCARL" edc:nzwidth="8" edc:por="xxx-xxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MDCL0" edc:desc="" edc:mask="0x1" edc:name="MDCL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MDCL1" edc:desc="" edc:mask="0x1" edc:name="MDCL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MDCL2" edc:desc="" edc:mask="0x1" edc:name="MDCL2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MDCL3" edc:desc="" edc:mask="0x1" edc:name="MDCL3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="MDCLSYNC" edc:desc="" edc:mask="0x1" edc:name="MDCLSYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MDCLPOL" edc:desc="" edc:mask="0x1" edc:name="MDCLPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MDCLODIS" edc:desc="" edc:mask="0x1" edc:name="MDCLODIS" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MDCL" edc:desc="" edc:mask="0xf" edc:name="MDCL" edc:nzwidth="4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn-nnnn" edc:cname="MDCARH" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuu-uuuu" edc:name="MDCARH" edc:nzwidth="8" edc:por="xxx-xxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MDCH0" edc:desc="" edc:mask="0x1" edc:name="MDCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MDCH1" edc:desc="" edc:mask="0x1" edc:name="MDCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MDCH2" edc:desc="" edc:mask="0x1" edc:name="MDCH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MDCH3" edc:desc="" edc:mask="0x1" edc:name="MDCH3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="MDCHSYNC" edc:desc="" edc:mask="0x1" edc:name="MDCHSYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MDCHPOL" edc:desc="" edc:mask="0x1" edc:name="MDCHPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MDCHODIS" edc:desc="" edc:mask="0x1" edc:name="MDCHODIS" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MDCH" edc:desc="" edc:mask="0xf" edc:name="MDCH" edc:nzwidth="4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="8" edc:beginaddr="0x400" edc:endaddr="0x420" edc:regionid="sfr8">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
        <edc:AdjustPoint edc:offset="9"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR4" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="TMR4" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR4" edc:desc="" edc:mask="0xff" edc:name="TMR4" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PR4" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="PR4" edc:nzwidth="0x8" edc:por="11111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PR4" edc:desc="" edc:mask="0xff" edc:name="PR4" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="T4CON" edc:desc="Timer2 Control Register" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="T4CON" edc:nzwidth="0x8" edc:por="-0000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="T4CKPS0" edc:desc="Timer2 Clock Prescale Select bits" edc:mask="0x1" edc:name="T4CKPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T4CKPS1" edc:desc="Timer2 Clock Prescale Select bits" edc:mask="0x1" edc:name="T4CKPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR4ON" edc:desc="Timer2 On bit" edc:mask="0x1" edc:name="TMR4ON" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T4OUTPS0" edc:desc="Timer2 Output Postscaler Select bits" edc:mask="0x1" edc:name="T4OUTPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T4OUTPS1" edc:desc="Timer2 Output Postscaler Select bits" edc:mask="0x1" edc:name="T4OUTPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T4OUTPS2" edc:desc="Timer2 Output Postscaler Select bits" edc:mask="0x1" edc:name="T4OUTPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T4OUTPS3" edc:desc="Timer2 Output Postscaler Select bits" edc:mask="0x1" edc:name="T4OUTPS3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T4CKPS" edc:desc="Timer2 Clock Prescale Select bits" edc:mask="0x3" edc:name="T4CKPS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="T4OUTPS" edc:desc="Timer2 Output Postscaler Select bits" edc:mask="0xf" edc:name="T4OUTPS" edc:nzwidth="4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR6" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="TMR6" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR6" edc:desc="" edc:mask="0xff" edc:name="TMR6" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PR6" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="PR6" edc:nzwidth="0x8" edc:por="11111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PR6" edc:desc="" edc:mask="0xff" edc:name="PR6" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="T6CON" edc:desc="Timer2 Control Register" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="T6CON" edc:nzwidth="0x8" edc:por="-0000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="T6CKPS0" edc:desc="Timer2 Clock Prescale Select bits" edc:mask="0x1" edc:name="T6CKPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T6CKPS1" edc:desc="Timer2 Clock Prescale Select bits" edc:mask="0x1" edc:name="T6CKPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR6ON" edc:desc="Timer2 On bit" edc:mask="0x1" edc:name="TMR6ON" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T6OUTPS0" edc:desc="Timer2 Output Postscaler Select bits" edc:mask="0x1" edc:name="T6OUTPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T6OUTPS1" edc:desc="Timer2 Output Postscaler Select bits" edc:mask="0x1" edc:name="T6OUTPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T6OUTPS2" edc:desc="Timer2 Output Postscaler Select bits" edc:mask="0x1" edc:name="T6OUTPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T6OUTPS3" edc:desc="Timer2 Output Postscaler Select bits" edc:mask="0x1" edc:name="T6OUTPS3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T6CKPS" edc:desc="Timer2 Clock Prescale Select bits" edc:mask="0x3" edc:name="T6CKPS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="T6OUTPS" edc:desc="Timer2 Output Postscaler Select bits" edc:mask="0xf" edc:name="T6OUTPS" edc:nzwidth="4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="15" edc:beginaddr="0x780" edc:endaddr="0x7A0" edc:regionid="sfr15">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="31" edc:beginaddr="0xF80" edc:endaddr="0xFF0" edc:regionid="sfr31">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
        <edc:AdjustPoint edc:offset="88"/>
        <edc:SFRDef edc:access="-----nnn" edc:cname="STATUS_SHAD" edc:desc="" edc:impl="0x07" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----uuu" edc:name="STATUS_SHAD" edc:nzwidth="8" edc:por="-----xxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="C_SHAD" edc:desc="" edc:mask="0x1" edc:name="C_SHAD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DC_SHAD" edc:desc="" edc:mask="0x1" edc:name="DC_SHAD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="Z_SHAD" edc:desc="" edc:mask="0x1" edc:name="Z_SHAD" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
